[
  {
    "id": "cut-the-rope",
    "name": "Take Care of Shadow Milk",
    "description": "**Take Care of Shadow Milk** transports you into the twilight theater that Shadow Milk Cookie calls home. This viral companion simulator hands you the caretaker's role, letting you shape his day-to-day routine while uncovering the secrets hidden behind the stage curtains.\n\n### Live-In Guardian Experience\nEvery interaction feels personal. Tap and drag to coax reactions, tidy up his space, or simply watch his moods shift with your choices. The point-and-click controls are deliberately lightweight so you can focus on storytelling moments instead of complicated systems.\n\n### Sandbox Freedom\nThere are no fail states or timers breathing down your neck. Instead, **Take Care of Shadow Milk** celebrates experimentation. Rearrange props, explore side rooms, and invent your own rituals as you move between his lounge, bedroom, kitchen, and private bath. Each zone invites a different style of play.\n\n### Smart Care Systems\n- **Energy Pulse**: A blue lightning icon tracks how energized he feels\n- **Wellness Meter**: The glowing heart icon keeps you updated on overall health\n- **Snack Signals**: Crimson food markers appear when it's time to serve delicacies from steak to tomatoes\n- **Bath Prompts**: On-screen cues tell you when to draw a soothing bath\n\nSlip into this whimsical caretaker fantasy where gentle nurturing and mischievous chaos happily coexist.",
    "thumbnailUrl": "/uploads/1756619405301-aiazr8.webp",
    "category": "meme-games",
    "tags": [
      "Meme Games"
    ],
    "rating": 5,
    "playCount": 1200000,
    "viewCount": 850000,
    "developer": "",
    "releaseDate": "2025",
    "addedDate": "2024-01-15",
    "isActive": true,
    "isFeatured": true,
    "gameType": "iframe",
    "gameUrl": "https://scratch.mit.edu/projects/1206876997/embed",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "gradientDescription": "**Take Care of Shadow Milk** is a viral caretaker sandbox that blends relaxed storytelling with playful experimentation."
  },
  {
    "name": "Take Care of Your Own Hollyberry",
    "description": "**Take Care of Your Own Hollyberry** invites you to unwind with the royal champion of *Cookie Run: Kingdom*. Provide gentle care, decorate her living space, and share quiet moments that highlight Hollyberry Cookie’s heroic yet affectionate personality.\n\n### Daily Rituals\nPrepare hearty meals, offer rejuvenating spa sessions, and select outfits that match her mood. Each interaction nudges her energy, bravery, and charm meters in subtle ways.\n\n### Cozy Customization\nArrange furniture, seasonal decor, and keepsakes from her adventures to craft a sanctuary that reflects her regal spirit. Rearranging the room keeps the experience fresh and personal.\n\n### Story Moments\nLight narrative vignettes surface as you bond, revealing backstory tidbits and playful conversations that deepen your connection with the legendary guardian.",
    "gradientDescription": "**Take Care of Your Own Hollyberry** is a soothing caretaker experience starring Hollyberry Cookie’s gentle heroism.",
    "thumbnailUrl": "/uploads/1756613786803-5x057o.webp",
    "category": "casual",
    "tags": [
      "Meme Games"
    ],
    "rating": 4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://scratch.mit.edu/projects/1207007542/embed",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "take-care-of-your-own-hollyberry",
    "addedDate": "2025-08-31",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Elastic Man",
    "description": "**Elastic Man** transforms stress relief into a goofy, tactile playground. Grab the character’s cheeks, eyelids, and nose, then stretch, twist, and snap them back with uncanny soft-body physics.\n\n### Hyper-Responsive Goo\nEvery tug ripples realistically thanks to advanced shader work and physics calculations. Stretch too far and the face hilariously contorts, only to settle back into a grin moments later.\n\n### No Rules—Just Fun\nThere are no objectives, timers, or scoreboards. It’s all about experimenting with elastic textures and finding new ways to squish and pull.\n\n### Perfect Fidget Toy\nWhether you have 30 seconds or 30 minutes, the combination of silly audio reactions and smooth visuals creates an endlessly replayable digital stress ball.",
    "gradientDescription": "**Elastic Man** is a squishy stress reliever where lifelike face physics react to every poke and pull.",
    "thumbnailUrl": "/uploads/1756614742469-79yml6.webp",
    "category": "casual",
    "tags": [
      "Clicker Games",
      "Meme Games"
    ],
    "rating": 4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://d21u3ic0kp9e91.cloudfront.net/elasticman/0/index.html",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "elastic-man",
    "addedDate": "2025-08-31",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Take Care of Your Own Burning Spice",
    "description": "**Take Care of Your Own Burning Spice** channels the fiery warrior from *Cookie Run* into a loyal virtual companion. Balance intense training sessions with restorative downtime to keep Burning Spice Cookie’s passion in check.\n\n### Nurture the Flame\nPrepare gourmet spice dishes, maintain his armor, and schedule practice matches to fine-tune his combat edge. Each activity influences his confidence and focus meters.\n\n### Dynamic Mood System\nHis aura flares brighter when he’s motivated and dims when he needs rest. Recognizing those cues helps you tailor the right activity at the right time.\n\n### Heroic Set Pieces\nUnlock training arenas and story events that reveal fresh lore, challenge scenarios, and collectible gear that decorate his quarters.",
    "gradientDescription": "**Take Care of Your Own Burning Spice** lets you mentor Burning Spice Cookie through fiery routines and calm interludes.",
    "thumbnailUrl": "/uploads/1756620001602-r8qej1.webp",
    "category": "casual",
    "tags": [
      "Meme Games"
    ],
    "rating": 4.5,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://scratch.mit.edu/projects/1207373782/embed",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": true,
    "id": "take-care-of-your-own-burning-spice",
    "addedDate": "2025-08-31",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "A Shedletsky POV",
    "description": "**A Shedletsky POV** plunges you into the surreal legends surrounding Roblox’s famed builder. Explore dreamlike halls, solve cryptic riddles, and piece together fragments of lore as realities bleed into one another.\n\n### Narrative Exploration\nEvery doorway leads to symbolic set pieces that reference ancient community myths. Interact with artifacts, decode messages, and trigger cutscenes that recontextualize the story.\n\n### Choice and Consequence\nMultiple routes and dialogue decisions subtly alter the tone of your journey, encouraging repeat playthroughs to uncover hidden endings.\n\n### Atmospheric Storytelling\nMinimalist visuals, eerie audio design, and deliberate pacing create a reflective mood that draws you deeper into Shedletsky’s enigmatic world.",
    "gradientDescription": "**A Shedletsky POV** invites Roblox lore enthusiasts into a moody, puzzle-laced narrative exploration.",
    "thumbnailUrl": "/uploads/1756620882612-us05b1.webp",
    "category": "casual",
    "tags": [
      "Clicker Games",
      "Meme Games"
    ],
    "rating": 4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://scratch.mit.edu/projects/1192006075/embed",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "a-shedletsky-pov",
    "addedDate": "2025-08-31",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Deer Adventure",
    "description": "**Deer Adventure** hands you the antlers and says, go explore. Roam sprawling meadows, bustling villages, and gravity-defying obstacle parks as a surprisingly agile deer with a limitless imagination.\n\n### Play Your Way\nSprint, leap, and body-slam through set-piece challenges or simply wander and discover hidden secrets. The sandbox encourages experimentation, whether you’re chasing achievements or inventing deer-sized chaos.\n\n### Toys Everywhere\nVehicles, trampolines, and environmental props invite delightful physics interactions. Strap rockets to your back or commandeer a sports car—the game rarely says no.\n\n### Lighthearted Tone\nBright colors, playful animations, and tongue-in-cheek humor make this a perfect pick for anyone who wants pure sandbox silliness without complicated rules.",
    "gradientDescription": "**Deer Adventure** is a carefree sandbox where a stunt-loving deer turns everyday environments upside down.",
    "thumbnailUrl": "/uploads/1756621186350-7jbnyi.webp",
    "category": "casual",
    "tags": [
      "Meme Games"
    ],
    "rating": 4.4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://game.azgame.io/deer-adventure/",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "deer-adventure",
    "addedDate": "2025-08-31",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Agar.io",
    "description": "**Agar.io** distills competitive multiplayer into a simple yet ruthlessly addictive format. Guide your cell around the arena, absorb pellets to grow, and outmaneuver rival players in a constant battle of size and positioning.\n\n### Survival of the Biggest\nLarger cells move slower but can split to surprise smaller targets. Timing when to split or merge becomes the key to dominating the leaderboard.\n\n### Instant Multiplayer Access\nJump into matches within seconds—no lengthy menus or downloads. Each arena fills with players from around the globe, ensuring unpredictable encounters.\n\n### Learn by Doing\nSubtle mechanics like corner trapping and virus manipulation reward practice, while the minimalist controls keep the focus on situational awareness.",
    "gradientDescription": "**Agar.io** delivers quick-fire multiplayer where smart movement and timely splits decide who rules the petri dish.",
    "thumbnailUrl": "/uploads/game-agario-1758074827837-zdkh38.webp",
    "category": "strategy",
    "tags": [
      "strategy"
    ],
    "rating": 4.5,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://emupedia.net/emupedia-game-agar.io/",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "agario",
    "addedDate": "2025-09-12",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Escape Raid",
    "description": "**Escape Raid** casts you as a relentless sheriff leading a convoy out of enemy territory. Drift through rugged wilderness roads, swap between heavy-hitting weapons, and survive wave after wave of attackers.\n\n### Controlled Chaos\nOne wrong move can flip your truck, so weaving through debris and enemy fire becomes an exhilarating test of precision driving.\n\n### Build Your Loadout\nCollect and upgrade more than 90 vehicles plus an arsenal of weapons. Experiment with combinations to find the perfect balance of speed, armor, and firepower.\n\n### Master the Controls\nDrive with WASD or arrow keys, fire using Space or the left mouse button, switch weapons with Q, toggle camera angles with C, and lock targeting using E. Mastery turns frantic escapes into cinematic victories.",
    "gradientDescription": "**Escape Raid** is a white-knuckle convoy escape filled with vehicle upgrades, heavy weapons, and relentless pressure.",
    "thumbnailUrl": "/uploads/game-escape-raid-1758074827841-d7nyu0.webp",
    "category": "racing",
    "tags": [
      "racing"
    ],
    "rating": 4.5,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://game.azgame.io/escape-raid/",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "escape-raid",
    "addedDate": "2025-09-17",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Chicken Flip",
    "description": "**Chicken Flip** embraces absurdity in the best way possible. Launch a fearless chicken down snowy slopes, fling it into the air, and spin through outrageous flips before sticking the landing like a pro.\n\n### Physics Comedy\nMomentum, rotation, and timing all matter—too much spin and you’ll crash beak-first into the hillside, too little and you’ll slide off-balance.\n\n### Collect and Customize\nGather coins to unlock new skins and upgrades that tweak how your feathered athlete performs.\n\n### Two-Button Brilliance\nPress D or the Right Arrow to propel forward, and A or the Left Arrow to slow down and adjust rotation. Simple inputs, endless slapstick entertainment.",
    "gradientDescription": "**Chicken Flip** is a two-button stunt show where a plucky chicken nails ridiculous aerial tricks—or faceplants gloriously.",
    "thumbnailUrl": "/uploads/1758075172080-g4m3g6.webp",
    "category": "arcade",
    "tags": [
      "arcade"
    ],
    "rating": 4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://game.azgame.io/chicken-flip/",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "chicken-flip",
    "addedDate": "2025-09-17",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Kickback Dash",
    "description": "**Kickback Dash** flips the shooter formula: recoil is your rocket. Fire your weapon to catapult it across rolling hills, chaining shots to stay airborne and rack up massive distances.\n\n### Endless Distance Challenge\nThere are no levels—just your personal best to beat. Each run generates new terrain that demands quick thinking and precise timing.\n\n### Upgrade Pathways\nInvest earnings into ammo capacity, recoil strength, launch boosts, and offline income to keep the momentum going even when you’re away.\n\n### Satisfying Loop\nBright visuals, crunchy sound effects, and the constant chase for better upgrades make every session feel energetic and rewarding.",
    "gradientDescription": "**Kickback Dash** turns weapon recoil into propulsion for an endlessly replayable distance challenge.",
    "thumbnailUrl": "/uploads/1758075735970-da9tep.webp",
    "category": "arcade",
    "tags": [
      "aracde"
    ],
    "rating": 4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://azgames.io/kickback-dash",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "kickback-dash",
    "addedDate": "2025-09-17",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Wacky Flip",
    "description": "**Wacky Flip** is a ragdoll gymnastics playground where every launch is an invitation to pull off outrageous aerial stunts.\n\n### Learn the Rhythm\nHold to crouch, release to jump, then tuck mid-air for rotation and extend to land. Timing those beats unlocks clean landings and sky-high scores.\n\n### Career of Challenges\nEight themed environments—each with ten missions—gradually dial up the difficulty, pushing you to chain flips, clear obstacles, and earn perfect ratings.\n\n### Score Multipliers\nNail consecutive tricks to trigger multipliers that send your leaderboard rank soaring, rewarding both precision and daring experimentation.",
    "gradientDescription": "**Wacky Flip** lets you master ragdoll gymnastics across escalating courses packed with daring trick goals.",
    "thumbnailUrl": "/uploads/1758076019005-2yb1i5.webp",
    "category": "simulation",
    "tags": [
      "simulation"
    ],
    "rating": 4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://game.azgame.io/wacky-flip/",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "wacky-flip",
    "addedDate": "2025-09-17",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Memopolis",
    "description": "Prepare to enter the zany, one-of-a-kind world of Memopolis, a city overflowing with hilarious challenges and iconic internet culture. This game invites you into a lighthearted universe built from your favorite memes, offering a vast and surprising world for you to freely roam and discover.\n\nEngaging Gameplay Mechanics\nYour adventure begins on the outskirts of the city. Your primary objective is to locate 8 diamond blocks and deliver them to Nubik, which will power up a mysterious portal. However, acquiring these blocks isn't so simple. You'll need to earn them by assisting the quirky inhabitants of Memopolis, fetching a wide array of items from every corner of the map.\n\nAlong your journey, you'll meet a cast of legendary characters, including Beluga, Sonic, Banana Cat, Spanky, Pepe the Frog, the Screaming Beaver, and many more. Each personality will present you with a unique and entertaining quest, pulling you further and deeper into the delightful chaos of this world.\n\nTips for New Players\nNeed a hint? Head to the inactive portal and activate the red arrow companion. This helpful guide will point you directly toward the item you're looking for.\n\nTalk to everyone! Regularly interacting with the city's meme citizens is the best way to uncover crucial quests and not miss out on any of the fun.\n\nProgress unlocks the world. The more efficiently you gather items and complete tasks, the more new and exciting districts of Memopolis will become available for you to explore.\n\nWhy You'll Love Memopolis\nA World of Humor and Creativity: Immerse yourself in a universe crafted from the boundless creativity and humor of meme culture.\n\nAdventure-Puzzle Hybrid: Experience gameplay that perfectly blends the thrill of exploration with clever, puzzle-like challenges.\n\nMeet Your Favorite Memes: Interact with an all-star lineup of the internet's most famous and beloved characters.\n\nAn Addictive Quest System: Get lost in a rich and diverse mission structure designed to keep you engaged and always eager for the next task.",
    "gradientDescription": "Prepare to enter the zany, one-of-a-kind world of Memopolis, a city overflowing with hilarious challenges and iconic internet culture.",
    "thumbnailUrl": "/uploads/1758249092644-etgsa6-PixPin_2025-09-19_10-31-22.webp",
    "category": "meme-games",
    "tags": [
      "meme"
    ],
    "rating": 4.4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://st.8games.net/7/8g/igra-memopolis/",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "memopolis",
    "addedDate": "2025-09-19",
    "viewCount": 0,
    "playCount": 0
  },
  {
    "name": "Curve Rush IO",
    "description": "Prepare for Curve Rush IO, a thrilling evolution of the beloved rolling ball genre. In this game, you will navigate treacherous, winding desert tracks, launching your ball off massive dunes to soar through the air. Precision is everything—sticking your landings perfectly is crucial for scoring big. What truly sets this game apart is its intense, real-time multiplayer mode, pitting you against a full lobby of competitors from around the globe.\n\nKey Features\nInfinite Desert Course: Roll your way through a vast, procedurally generated desert where no two runs are ever the same.\n\nGravity-Defying Jumps: Launch your ball over the horizon. The more airtime you get, the higher your score will climb.\n\nUnlockable Content: Snag coins during your runs to unlock new ball designs, challenging maps, and exclusive high-stakes tournaments.\n\nGlobal Multiplayer Races: Prove your skill by competing directly against numerous other players in exhilarating live races.\n\nMomentum is Everything: Master the art of the smooth landing to maintain your speed, keep your flow, and travel farther than anyone else.\n\nHow to Play Curve Rush IO\nOn PC: Control the ball using your Mouse, the Spacebar, or the Up Arrow Key.\n\nOn Mobile: Touch and hold the screen to accelerate down slopes. Release to fly into the air, then touch and hold again as you land to maintain your momentum.\n\nWhy Should You Play?\nCurve Rush IO features a control scheme that is simple to learn but presents a deep challenge to master. It’s the perfect game for sharpening your reflexes and competing for bragging rights with friends. If you're a fan of high-speed action, adrenaline-pumping excitement, and the addictive challenge of an endless racer, this game was made for you.",
    "gradientDescription": "Prepare for Curve Rush IO, a thrilling evolution of the beloved rolling ball genre.",
    "thumbnailUrl": "/uploads/1758249596638-i1rp1c-PixPin_2025-09-19_10-37-20.webp",
    "category": "strategy",
    "tags": [
      "ball game"
    ],
    "rating": 4,
    "developer": "",
    "releaseDate": "2025",
    "gameType": "iframe",
    "gameUrl": "https://game.azgame.io/curve-rush-io/",
    "externalUrl": "",
    "embedCode": "",
    "controls": [],
    "platforms": [
      "web"
    ],
    "languages": [
      "en"
    ],
    "features": [],
    "isActive": true,
    "isFeatured": false,
    "id": "curve-rush-io",
    "addedDate": "2025-09-19",
    "viewCount": 0,
    "playCount": 0
  }
]